title: Detect Phishing Links via Suspicious TLDs
id: 2d98fb25-5cbe-412d-8b58-fbb68fbc84b6
status: experimental
description: Detects suspicious URLs with known TLDs often associated with phishing campaigns
author: Dexter
logsource:
  product: network
  service: proxy
  category: network-activity
detection:
  selection:
    url|like: 
      - "%.xyz"
      - "%.top"
      - "%.online"
      - "%.club"
      - "%.gq"
  condition: selection
  falsepositives:
    - Known sites with these TLDs 
  level: high
fields:
  - url
  - src_ip
  - dest_ip
  - user_agent
  - _time
  - host
  - method
  - bytes_in
  - bytes_out
